#-------------------------------------------------------------------------------
# Taps
#-------------------------------------------------------------------------------

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"

# tap "homebrew/php"
# tap "homebrew/services"


#-------------------------------------------------------------------------------
# Install Binaries
#-------------------------------------------------------------------------------

brew "readline"
brew "xz"
brew "awscli"
brew "coreutils"
brew "direnv"
brew "fasd"
brew "fzf"
brew "git"
brew "git-flow-avh"
brew "git-lfs"
brew "httpie"
brew "neovim"
brew "pipenv"
brew "pyenv"
brew "qcachegrind"
brew "terraform"
brew "tree"
brew "wget"
brew "zlib"
brew "zsh"
brew "zsh-completions"

# brew "sqlite"
# brew "circleci"
# brew "kubernetes-cli", link: false
# brew "composer"
# brew "rbenv"
# brew "sbt"
# brew "maven"
# brew "minikube"
# brew "mysql"
# brew "go"
# brew "gradle"
# brew "haskell-stack"
# brew "jenv"

#----

brew "htop"
brew "jq"
brew "tcpdump"

#-------------------------------------------------------------------------------
# Apps
#-------------------------------------------------------------------------------

cask "font-hack-nerd-font"

# cask "discord"
# cask "emacs"
# cask "java"
# cask "java8"
# cask "minikube"

#----

cask "google-chrome"
cask "iterm2"
cask "postman"
cask "sequel-pro"
cask "slack"
cask "vagrant"
cask "virtualbox"
cask "visual-studio-code"
cask 'wireshark'
