#-------------------------------------------------------------------------------
# Homebrew Taps
#-------------------------------------------------------------------------------
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/cask-fonts"
tap "homebrew/services"

#-------------------------------------------------------------------------------
# Libraries
#-------------------------------------------------------------------------------

# Command Line Tools
brew "asdf"
brew "awscli"
brew "ctop"
brew "tree"
brew "wget"
brew "mas"
brew "exercism"
brew "navi"

# A collection of modern commands
# @see https://github.com/ibraheemdev/modern-unix
brew "bat" # A `cat` clone with syntax highlighting and Git integration.
brew "exa" # A modern replacement for `ls`.
brew "git-delta" # A viewer for `git` and `diff` output.
brew "dust" # A more intutive version of `du` written in rust.
brew "duf" # A better `df` alternative.
brew "broot" # A new way to see and navigate directory `tree`s.
brew "fd" # A simple, fast and user-friendly alternative to `find`.
brew "ripgrep" # An extremely fast alternative to `grep` that respects your gitignore.
brew "ag" # A code searching tool simliar to `ack`, but faster.
brew "fzf" # A general purpose command-line fuzzy finder.
brew "jq" # `sed` for JSON data.
brew "sd" # An intuitive find & replace CLI (`sed` alternative).
brew "tldr" # A community effort to simplify `man` pages with practical examples.
brew "procs" # A modern replacement for `ps` written in Rust.
brew "httpie" # A modern, user-friendly command-line HTTP client for the API era.
brew "zoxide" # A smarter `cd` command inspired by `z`.

# Git
brew "git"
brew "git-lfs"
brew "gh"
brew "gitui"

# Related Terminal & Editor & Shell
brew "zsh"
brew "tmux"
brew "starship"
brew "fish"
brew "neovim"

## Haskell
# brew "haskell-stack"

## Java
# brew "openjdk"

## DevOps
# brew "circleci"
# brew "terraform"

## Etc..
brew "gnu-getopt"
brew "gnupg"
brew "coreutils"
brew "readline"
# @see https://github.com/pyenv/pyenv/wiki#suggested-build-environment
# brew install openssl readline sqlite3 xz zlib
brew "glow"

#-------------------------------------------------------------------------------
# External Application (Homebrew Cask)
#-------------------------------------------------------------------------------
cask "alacritty"
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "gpg-suite"
cask "keybase"
cask "karabiner-elements"
cask "tableplus"
cask "stats"
cask "rectangle"
cask "mathpix-snipping-tool"
# cask "obsidian"

#----
cask "google-chrome"
cask "virtualbox"
cask "visual-studio-code"
cask "vagrant"
cask "iterm2"

#-------------------------------------------------------------------------------
# Application in AppStore (Mas)
#-------------------------------------------------------------------------------
mas "1Password 7", id: 1333542190
mas "Bear", id: 1091189122
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Slack", id: 803453959

# @see https://flowapp.info/
# Flow - Focus & Pomodoro Timer
# mas "flow"

# mas "The Unarchiver", id: 425424353
# mas "Xcode", id: 497799835
# mas "Polaris Office Sync", id: 928980286
# mas "Polaris Office", id: 1098211970
# mas "Cleaner-App", id: 1013897218
# mas "Disk Speed Test", id: 425264550
# mas "KakaoTalk", id: 869223134
# mas "iMovie", id: 408981434
# mas "Memory Clean", id: 451444120
# mas "Novabench", id: 411466132
# mas "Microsoft Remote Desktop", id: 715768417
# mas "GarageBand", id: 682658836
# mas "Evernote", id: 406056744
k
