#-------------------------------------------------------------------------------
# Homebrew Taps
#-------------------------------------------------------------------------------
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/cask-fonts"
tap "homebrew/services"

#-------------------------------------------------------------------------------
# Libraries 
#-------------------------------------------------------------------------------

# Command Line Tools
brew "asdf"
brew "awscli"
brew "bat"
brew "dust"
brew "ctop"
brew "exa"
brew "fd"
brew "fzf"
brew "httpie"
brew "jq"
brew "tree"
brew "wget"
brew "procs"
brew "ripgrep"
brew "mas"
brew "git-delta"
brew "zoxide"
brew "tldr"
brew "exercism"

# Git
brew "git"
brew "git-lfs"
brew "gh"
brew "gitui"

# Related Terminal & Editor & Shell
brew "zsh"
brew "tmux"
brew "starship"
brew "fish"
brew "neovim"

## Haskell
# brew "haskell-stack"

## Java
brew "openjdk"

## DevOps
# brew "circleci"
# brew "terraform"

## Etc..
brew "gnu-getopt"
brew "gnupg"
brew "coreutils"
brew "readline"
# @see https://github.com/pyenv/pyenv/wiki#suggested-build-environment
# brew install openssl readline sqlite3 xz zlib

#-------------------------------------------------------------------------------
# External Application (Homebrew Cask)
#-------------------------------------------------------------------------------
cask "alacritty"
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "gpg-suite"
cask "keybase"
cask "karabiner-elements"
cask "tableplus"
# cask "obsidian"

#----
cask "google-chrome"
cask "virtualbox"
cask "visual-studio-code"
cask "vagrant"
cask "iterm2"

#-------------------------------------------------------------------------------
# Application in AppStore (Mas)
#-------------------------------------------------------------------------------
mas "1Password 7", id: 1333542190
mas "Bear", id: 1091189122
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Slack", id: 803453959

# @see https://flowapp.info/
# Flow - Focus & Pomodoro Timer
# mas "flow"

# mas "The Unarchiver", id: 425424353
# mas "Xcode", id: 497799835
# mas "Polaris Office Sync", id: 928980286
# mas "Polaris Office", id: 1098211970
# mas "Cleaner-App", id: 1013897218
# mas "Disk Speed Test", id: 425264550
# mas "KakaoTalk", id: 869223134
# mas "iMovie", id: 408981434
# mas "Memory Clean", id: 451444120
# mas "Novabench", id: 411466132
# mas "Microsoft Remote Desktop", id: 715768417
# mas "GarageBand", id: 682658836
# mas "Evernote", id: 406056744

